Tekla Open API Reference for Tekla Structures 2025
ControlPoint Constructor
Overload List
Name | Description
ControlPoint()
 Initializes a new instance of the ControlPoint class with zero members.
ControlPoint(Point)
 Initializes a new instance of the ControlPoint class with an existing point.
Top
See Also
Reference
ControlPoint Class
Tekla.Structures.Model Namespace